In [2]:
from sklearn.model_selection import train_test_split
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('Employee.csv')
##df.head()

In [7]:
X = df.iloc[:,:-1] # Target
y = df.iloc[:,-1] # Feature

In [8]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

## Train set dan test set

In [9]:
print("Dimensi X_train : ", X_train.shape)
print("Dimensi X_train : ", X_test.shape)
print("Dimensi y_train : ", y_train.shape)
print("Dimensi y_test : ", y_test.shape)

Dimensi X_train :  (3722, 8)
Dimensi X_train :  (931, 8)
Dimensi y_train :  (3722,)
Dimensi y_test :  (931,)

In [10]:
from sklearn.preprocessing import StandardScaler
import numpy as np

In [11]:
data = np.asarray([[100, 0.001],
[8, 0.05],
[50, 0.005],
[88, 0.07],])

In [12]:
ss = StandardScaler()
Scaled_data = ss.fit_transform(data)

## Data Tranformation

In [13]:
print("Nilai Data Sebelum scaling : ")
print(data)
print("Nilai standar deviasi: ", np.std(data))
print("\n Nilai Data setelah scaling : ")
print(Scaled_data)
print("Nilai standar deviasi: ", np.std(Scaled_data))

Nilai Data Sebelum scaling :
[[1.0e+02 1.0e-03]
 [8.0e+00 5.0e-02]
 [5.0e+01 5.0e-03]
 [8.8e+01 7.0e-02]]
Nilai standar deviasi:  39.89949316955668

 Nilai Data setelah scaling :
[[ 1.06996056 -1.03748098]
 [-1.48682831  0.62929174]
 [-0.31959861 -0.9014179 ]
 [ 0.73646636  1.30960714]]
Nilai standar deviasi:  1.0

In [14]:
from sklearn.impute import SimpleImputer

In [15]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

## Hasil data frame

In [16]:
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

## Melihat nilai null

In [17]:
print("Jumlah record yang memiliki nilai null:")
print(df.isna().sum())

Jumlah record yang memiliki nilai null:
Education                    0
JoiningYear                  0
City                         0
PaymentTier                  0
Age                          0
Gender                       0
EverBenched                  0
ExperienceInCurrentDomain    0
LeaveOrNot                   0
dtype: int64

In [18]:
imputer = SimpleImputer(strategy='mean')
df["Age"] = imputer.fit_transform(df[["Age"]])

# Melihat hasil dataframe yang berubah

In [19]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38.0,Female,No,2,0
3,Masters,2016,Bangalore,3,27.0,Male,No,5,1
4,Masters,2017,Pune,3,24.0,Male,Yes,2,1